app/controllers/todolists_controller.rb

  def create

    list = List.new(list_params)

    list.save
---
INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["body", ""], ["created_at", "2021-04-15 01:15:23.078416"], ["updated_at", "2021-04-15 01:15:23.078416"]]

  def index
    @lists = List.all
---
SELECT "lists".* FROM "lists"

  def show
    @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def edit
    @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    list = List.find(params[:id])
    list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "lists" SET "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["body", "編集機能"], ["updated_at", "2021-04-16 04:21:25.746785"], ["id", 4]]

  def destroy
    list = List.find(params[:id])
    list.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 4]]